systests/uncategorized/src/test/java/org/apache/cxf/systest/ws/rm/onewayReqThree.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <greetMeOneWay xmlns="http://cxf.apache.org/greeter_control/types">
      <requestType>thrice</requestType>
    </greetMeOneWay>
  </soap:Body>
</soap:Envelope>
