systests/ws-rm/src/test/java/org/apache/cxf/systest/ws/rm/twowayReqOne.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <greetMe xmlns="http://cxf.apache.org/greeter_control/types">
         <requestType>one</requestType>
      </greetMe>
   </soap:Body>
</soap:Envelope>
